INSERT INTO users (id, email, role, password, name, surname, birthdate, gender, about_me, profile_type, registered_at)
VALUES (1, 'ivanov_arkadiy@senla.ru', 'USER', '$2a$10$Smy9JptsypUyVBHOTMidTeh3pEZ9UA1uoGv6H5yLhqXXdLMkQsTKK',
        'Arkadiy', 'Ivanov', '1995-05-15', 'MALE', 'MSU EF student / trader', 'CLOSED', '2025-04-09 10:15:00+03'),
       (2, 'petrova_anna@senla.ru', 'USER', '$2a$10$Smy9JptsypUyVBHOTMidTeh3pEZ9UA1uoGv6H5yLhqXXdLMkQsTKK',
        'Anna', 'Petrova', '1998-08-22', 'FEMALE', 'Python developer, Yandex', 'CLOSED', '2025-04-09 11:30:00+03'),
       (3, 'sidorov_dmitry@senla.ru', 'USER', '$2a$10$Smy9JptsypUyVBHOTMidTeh3pEZ9UA1uoGv6H5yLhqXXdLMkQsTKK',
        'Dmitry', 'Sidorov', '1992-11-30', 'MALE', 'Will be a Top G', 'OPEN', '2025-04-09 12:45:00+03'),
       (4, 'smirnova_elena@senla.ru', 'USER', '$2a$10$Smy9JptsypUyVBHOTMidTeh3pEZ9UA1uoGv6H5yLhqXXdLMkQsTKK',
        'Elena', 'Smirnova', '1990-03-10', 'FEMALE', 'Акционер технологических компаний', 'CLOSED',
        '2025-04-09 14:00:00+03'),
       (5, 'kozlov_alexey@senla.ru', 'USER', '$2a$10$Smy9JptsypUyVBHOTMidTeh3pEZ9UA1uoGv6H5yLhqXXdLMkQsTKK',
        'Alexey', 'Kozlov', '2000-01-01', 'MALE', 'Профессиональный рыбак, участник турниров', 'CLOSED',
        '2025-04-09 15:15:00+03'),
       (6, 'nikolaeva_olga@senla.ru', 'USER', '$2a$10$Smy9JptsypUyVBHOTMidTeh3pEZ9UA1uoGv6H5yLhqXXdLMkQsTKK',
        'Olga', 'Nikolaeva', '1997-07-18', 'FEMALE', 'Спортсменка, мастер спорта по плаванию', 'CLOSED',
        '2025-04-09 16:30:00+03'),
       (7, 'fedorov_maxim@senla.ru', 'USER', '$2a$10$Smy9JptsypUyVBHOTMidTeh3pEZ9UA1uoGv6H5yLhqXXdLMkQsTKK',
        'Maxim', 'Fedorov', '2002-09-25', 'MALE', 'Студент MBA, будущий предприниматель', 'CLOSED',
        '2025-04-09 17:45:00+03'),
       (8, 'morozova_ekaterina@senla.ru', 'USER', '$2a$10$Smy9JptsypUyVBHOTMidTeh3pEZ9UA1uoGv6H5yLhqXXdLMkQsTKK',
        'Ekaterina', 'Morozova', '1993-04-05', 'FEMALE', 'UX/UI дизайнер в крупной IT компании', 'CLOSED',
        '2025-04-09 19:00:00+03'),
       (9, 'volkov_andrey@senla.ru', 'USER', '$2a$10$Smy9JptsypUyVBHOTMidTeh3pEZ9UA1uoGv6H5yLhqXXdLMkQsTKK',
        'Andrey', 'Volkov', '2005-12-12', 'MALE', 'Увлекаюсь робототехникой', 'CLOSED', '2025-04-09 20:15:00+03'),
       (10, 'orlova_maria@senla.ru', 'USER', '$2a$10$Smy9JptsypUyVBHOTMidTeh3pEZ9UA1uoGv6H5yLhqXXdLMkQsTKK',
        'Maria', 'Orlova', '2007-06-20', 'FEMALE', 'Будущий врач, учусь в медицинском колледже', 'CLOSED',
        '2025-04-09 21:30:00+03'),
       (11, 'admin@senla.ru', 'ADMIN', '$2a$10$zp4b4MEUJJPBESQka4E7tuHFYnGMAwYa2OqZxLo5LeNX66fLeKa4m',
        'Admin', 'Senla', '1995-04-20', 'MALE', 'Java Web Developer, Founder of this application', 'CLOSED',
        '2025-04-09 09:00:00+03');

SELECT setval('users_id_seq', (SELECT MAX(id) FROM users));


-- Заявки в друзья между пользователями
INSERT INTO friend_requests (sender_id, recipient_id, status, created_at)
VALUES
    -- Активные заявки (PENDING)
    (1, 2, 'PENDING', '2025-04-15 10:00:00+03'),  -- Аркадий к Анне
    (5, 2, 'PENDING', '2025-04-15 10:00:00+03'),  -- Аркадий к Анне
    -- Принятые заявки (ACCEPTED)
    (1, 3, 'ACCEPTED', '2025-04-10 09:15:00+03'), -- Аркадий и Дмитрий
    -- Отклоненные заявки (REJECTED)
    (7, 1, 'REJECTED', '2025-04-13 17:40:00+03'), -- Максим к Аркадию
    -- Отмененные заявки (CANCELLED)
    (5, 7, 'CANCELLED', '2025-04-16 20:10:00+03');
-- Алексей к Максиму

-- Обновляем последовательность для ID
SELECT setval('friend_requests_id_seq', (SELECT MAX(id) FROM friend_requests));


-- Чаты
INSERT INTO chats (id, name, is_group, created_at)
VALUES
    -- Личные
    (1, NULL, false, '2025-04-10 09:30:00+03'), -- Аркадий - Анна
    (2, NULL, false, '2025-04-11 14:20:00+03'), -- Дмитрий - Елена
    -- Групповые
    (3, 'Java Team', true, '2025-04-14 13:30:00+03');

SELECT setval('chats_id_seq', (SELECT MAX(id) FROM chats));

-- Участники чатов
INSERT INTO group_members (id, user_id, chat_id, join_date, role, gm_type, muted_until)
VALUES
    -- Аркадий - Анна
    (1, 1, 1, '2025-04-10 09:30:00+03', 'MEMBER', 'CHAT', null),
    (2, 2, 1, '2025-04-10 09:30:00+03', 'MEMBER', 'CHAT', null),
    -- Дмитрий - Елена
    (3, 3, 2, '2025-04-11 14:20:00+03', 'MEMBER', 'CHAT', null),
    (4, 4, 2, '2025-04-11 14:20:00+03', 'MEMBER', 'CHAT', null),
    -- "Java Team" (Анна, Алексей, Максим, Админ)
    (5, 2, 3, '2025-04-14 13:30:00+03', 'ADMIN', 'CHAT', null),
    (6, 5, 3, '2025-04-14 13:35:00+03', 'MEMBER', 'CHAT', '2026-04-11 15:00:00+03'),
    (7, 7, 3, '2025-04-14 13:40:00+03', 'MEMBER', 'CHAT', '2026-04-11 15:00:00+03'),
    (8, 11, 3, '2025-04-14 13:45:00+03', 'MEMBER', 'CHAT', null);

-- Сообщения в чатах
INSERT INTO content_fragments (id, author_id, chat_id, body, created_at, cf_type, is_pinned)
VALUES
    -- Личный чат 2 (Дмитрий ↔ Елена)
    (1, 3, 2, 'Привет, Елена!', '2025-04-11 15:00:00+03', 'MESSAGE', false),
    (2, 4, 2, 'Здравствуй, Дмитрий', '2025-04-11 15:10:00+03', 'MESSAGE', false),
    (3, 3, 2, 'Как твои инвестиции?', '2025-04-11 16:20:00+03', 'MESSAGE', false),

    -- Групповой чат "Java Team"
    (4, 2, 3, 'Ребята, кто разбирается в Spring Security?', '2025-04-14 14:00:00+03', 'MESSAGE', false),
    (5, 11, 3, 'Я могу помочь', '2025-04-14 14:05:00+03', 'MESSAGE', false),
    (6, 5, 3, 'У меня тоже есть опыт', '2025-04-14 14:10:00+03', 'MESSAGE', false),
    (7, 2, 3, 'Давайте созвонимся завтра)', '2025-04-14 16:20:00+03', 'MESSAGE', true);

INSERT INTO communities (id, name, description, created_at)
VALUES (1, 'Трейдеры и инвесторы', 'Сообщество для обсуждения рынков и инвестиций', '2025-04-10 09:00:00+03'),
       (2, 'Java Developers', 'Сообщество Java-разработчиков. Spring, Hibernate, Jakarta EE', '2025-04-11 10:00:00+03'),
       (3, 'Спортивное плавание', 'Все о плавании: тренировки, соревнования, экипировка', '2025-04-12 11:00:00+03');

INSERT INTO group_members (id, user_id, community_id, join_date, role, gm_type, is_banned, banned_reason)
VALUES
-- "Трейдеры и инвесторы"
(9, 1, 1, '2025-04-10 09:05:00+03', 'ADMIN', 'COMMUNITY', false, NULL),
(10, 3, 1, '2025-04-10 10:15:00+03', 'MEMBER', 'COMMUNITY', false, NULL),
(11, 4, 1, '2025-04-10 11:30:00+03', 'MEMBER', 'COMMUNITY', true, 'Нарушение правил сообщества: реклама'),

-- "Java Developers"
(12, 11, 2, '2025-04-11 10:05:00+03', 'ADMIN', 'COMMUNITY', false, NULL),
(13, 2, 2, '2025-04-11 12:45:00+03', 'MODERATOR', 'COMMUNITY', false, NULL),
(14, 5, 2, '2025-04-11 14:20:00+03', 'MEMBER', 'COMMUNITY', false, NULL),
(15, 7, 2, '2025-04-11 15:30:00+03', 'MEMBER', 'COMMUNITY', true, 'Флуд и оффтоп'),

-- "Спортивное плавание"
(16, 6, 3, '2025-04-12 11:05:00+03', 'ADMIN', 'COMMUNITY', false, NULL),
(17, 8, 3, '2025-04-12 13:10:00+03', 'MEMBER', 'COMMUNITY', false, NULL),
(18, 10, 3, '2025-04-12 15:40:00+03', 'MEMBER', 'COMMUNITY', true, 'Оскорбление участников');

SELECT setval('group_members_id_seq', (SELECT MAX(id) FROM group_members));


-- Посты в сообществах
INSERT INTO posts (id, author_id, community_id, body, created_at, post_type, is_pinned)
VALUES (1, 9, 1, 'Сегодня сильное движение на нефтяном рынке, все в шорте?', '2025-04-10 09:30:00+03', 'COMMUNITY', false),
       (2, 11, 1, 'Кто что думает про акции Tesla после последнего отчета?', '2025-04-10 14:45:00+03', 'COMMUNITY', false),

       (3, 12, 2, 'Переходим на Spring Boot 3.2 - основные изменения', '2025-04-11 11:20:00+03', 'COMMUNITY', false),
       (4, 10, 2, 'Как правильно делать интеграционные тесты в Spring?', '2025-04-11 13:45:00+03', 'COMMUNITY', false),
       (5, 13, 2, 'Hibernate vs JPA - в чем разница на практике?', '2025-04-11 16:30:00+03', 'COMMUNITY', false),
       (6, 12, 2, 'Новый LTS релиз Java 21 - кто уже перешел?', '2025-04-11 17:50:00+03', 'COMMUNITY', false),

       (7, 14, 3, 'Подготовка к чемпионату Москвы - график тренировок', '2025-04-12 12:15:00+03', 'COMMUNITY', true),
       (8, 16, 3, 'Обзор новых гидрокостюмов 2025 года', '2025-04-12 17:50:00+03', 'COMMUNITY', false);

-- Посты на стенах пользователей
INSERT INTO posts (id, wall_owner_id, body, created_at, post_type, mood, location)
VALUES
--  Arkadiy Ivanov (трейдер)
(9, 1, 'Сегодня закрыл позицию по нефти с прибылью 15%. Хороший день!', '2025-04-15 18:30:00+03', 'WALL', 'Успех',
 'Москва, офис'),
(10, 1, 'Анализирую отчеты компаний сектора технологий. Какие акции сейчас выглядят привлекательно?',
 '2025-04-20 10:15:00+03', 'WALL', 'Анализ', 'Домашний офис'),

-- Anna Petrova (Python разработчик)
(11, 2, 'Закончила большой проект по миграции на Python 3.11. Ура!', '2025-04-16 19:45:00+03', 'WALL', 'Побеждаю',
 'Офис Yandex'),
(12, 2, 'Ищу интересные open-source проекты для участия. Посоветуйте что-то стоящее!', '2025-04-22 14:20:00+03', 'WALL',
 'Интересуюсь', NULL),

-- Dmitry Sidorov (Top G)
(13, 3, 'Новый рекорд в жиме лежа - 150 кг! Иду к своей цели!', '2025-04-18 20:00:00+03', 'WALL', 'Достижения',
 'Спортзал "Сталь"'),
(14, 3, 'Читаю "48 законов власти". Рекомендую всем, кто хочет добиться успеха.', '2025-04-25 12:30:00+03', 'WALL',
 'Мотивация', NULL),

-- Olga Nikolaeva (спортсменка)
(15, 6, 'Сегодня установила личный рекорд на дистанции 200м баттерфляем! 2:15.37', '2025-04-17 21:10:00+03', 'WALL',
 'Горжусь', 'Бассейн "Олимпийский"'),
(16, 6, 'Готовлюсь к чемпионату России. Тренировки по 2 раза в день!', '2025-04-23 08:45:00+03', 'WALL', 'Иду к цели',
 'Тренировочная база'),
(17, 6, 'Отдых после тяжелых соревнований. Море, солнце и никаких мыслей о плавании :)', '2025-04-30 15:20:00+03', 'WALL',
 'Отдыхаю', 'Сочи'),

-- Maxim Fedorov (студент MBA)
(18, 7, 'Защитил бизнес-план по запуску стартапа. Преподаватели оценили на 9/10!', '2025-04-19 16:40:00+03', 'WALL',
 'Иду к мечте', 'Университет'),
(19, 7, 'Ищу соучредителей для IT-стартапа в сфере образования. Есть интересные идеи!', '2025-04-27 11:15:00+03', 'WALL',
 'Энтузиазм', NULL);

SELECT setval('posts_id_seq', (SELECT MAX(id) FROM posts));


-- Комментарии к постам на стенах пользователей
INSERT INTO content_fragments (id, author_id, post_id, body, created_at, cf_type)
VALUES
-- Arkadiy Ivanov (трейдер)
-- К первому посту (о нефти)
(8, 2, 1, 'Поздравляю с прибылью! Я тоже сегодня закрылся в плюс.', '2025-04-15 19:10:00+03', 'COMMENT'),
(9, 4, 1, 'А я наоборот, купил фьючерсы. Думаю, нефть пойдет вверх после завтрашнего отчета.', '2025-04-15 20:45:00+03',
 'COMMENT'),

-- Ко второму посту (о технологиях)
(10, 3, 2, 'Apple выглядит перепроданной после коррекции, хорошая точка входа.', '2025-04-20 11:30:00+03', 'COMMENT'),
(11, 5, 2, 'А что думаешь про NVIDIA? ИИ-тренд продолжается.', '2025-04-20 12:15:00+03', 'COMMENT'),

-- Anna Petrova (Python разработчик)
-- К первому посту (миграция на Python 3.11)
(12, 11, 3, 'Какие основные проблемы были при миграции?', '2025-04-16 20:30:00+03', 'COMMENT'),

-- Ко второму посту (open-source)
(13, 5, 4, 'Посмотри проект FastAPI, там всегда нужна помощь с документацией.', '2025-04-22 15:40:00+03', 'COMMENT'),

-- Dmitry Sidorov (Top G)
-- К первому посту (жим лежа)
(14, 6, 5, 'Отличный результат! Как давно тренируешься?', '2025-04-18 21:30:00+03', 'COMMENT'),

-- Ко второму посту (48 законов власти)
(15, 7, 6, 'Читал. Советую еще "Искусство войны" Сунь-Цзы.', '2025-04-25 13:45:00+03', 'COMMENT'),

-- Комментарии к постам Olga Nikolaeva (спортсменка)
-- К первому посту (рекорд)
(16, 8, 7, 'Молодец! Это отличное время!', '2025-04-17 22:20:00+03', 'COMMENT'),
(17, 10, 7, 'Как ты готовилась к этому заплыву?', '2025-04-18 09:15:00+03', 'COMMENT'),

-- Ко второму посту (чемпионат России)
(18, 9, 8, 'Удачи на соревнованиях! Болеем за тебя!', '2025-04-23 10:30:00+03', 'COMMENT'),

-- Комментарии к постам Maxim Fedorov (студент MBA)
-- К первому посту (бизнес-план)
(19, 11, 10, 'Какая была тема бизнес-плана?', '2025-04-19 17:50:00+03', 'COMMENT'),

-- Ко второму посту (стартап)
(20, 2, 11, 'Какие технологии планируешь использовать?', '2025-04-27 12:30:00+03', 'COMMENT');


-- Комментарии к постам в сообществах
INSERT INTO content_fragments (id, author_id, post_id, body, created_at, cf_type)
VALUES
-- "Трейдеры и инвесторы"
-- К посту о нефтяном рынке
(21, 3, 1, 'Я в шорте с утра, но думаю скоро разворот.', '2025-04-10 10:15:00+03', 'COMMENT'),
(22, 4, 1, 'Будьте осторожны, завтра выходит отчет по запасам.', '2025-04-10 11:45:00+03', 'COMMENT'),

-- К посту о Tesla
(23, 1, 2, 'Я бы подождал до следующего квартала, слишком много неопределенности.', '2025-04-10 15:30:00+03',
 'COMMENT'),
(24, 4, 2, 'А я наоборот купил - долгосрочная перспектива хорошая.', '2025-04-10 16:20:00+03', 'COMMENT'),

-- "Java Developers"
-- К посту о Spring Boot 3.2
(25, 5, 3, 'А есть обратная совместимость с 3.1?', '2025-04-11 12:45:00+03', 'COMMENT'),

-- К посту об интеграционных тестах
(26, 11, 4, 'Используйте @TestContainers для тестов с БД - очень удобно!', '2025-04-11 14:30:00+03', 'COMMENT'),

-- К посту о Hibernate vs JPA
(27, 4, 5, 'JPA - это спецификация, Hibernate - ее реализация.', '2025-04-11 17:15:00+03', 'COMMENT'),

-- К посту о Java 21
(28, 5, 6, 'Virtual Threads в 21 - это game changer!', '2025-04-11 19:20:00+03', 'COMMENT'),

-- "Спортивное плавание"
-- К посту о чемпионате Москвы
(29, 8, 7, 'Буду участвовать! Увидимся на тренировках!', '2025-04-12 13:30:00+03', 'COMMENT'),
(30, 10, 7, 'Какие дистанции будешь плыть?', '2025-04-12 14:15:00+03', 'COMMENT'),

-- К посту о гидрокостюмах
(31, 9, 8, 'Какой марки костюм тебе больше понравился?', '2025-04-12 18:30:00+03', 'COMMENT');

SELECT setval('content_fragments_id_seq', (SELECT MAX(id) FROM content_fragments));


-- Реакции на комментарии к постам на стенах пользователей
INSERT INTO reactions (id, type, user_id, comment_id, created_at)
VALUES
-- постам Arkadiy Ivanov
-- о прибыли
(1, 'LIKE', 3, 8, '2025-04-15 19:30:00+03'),
(2, 'LIKE', 5, 8, '2025-04-15 20:00:00+03'),
-- о фьючерсах
(3, 'LIKE', 1, 9, '2025-04-15 21:00:00+03'),
(4, 'DISLIKE', 3, 9, '2025-04-15 21:15:00+03'),
-- об Apple
(5, 'LIKE', 4, 10, '2025-04-20 12:00:00+03'),
(6, 'LIKE', 2, 10, '2025-04-20 12:30:00+03'),
-- о NVIDIA
(7, 'LIKE', 1, 11, '2025-04-20 13:00:00+03'),
(8, 'DISLIKE', 3, 11, '2025-04-20 13:30:00+03'),

-- к постам Anna Petrova
-- о проблемах миграции
(9, 'LIKE', 2, 12, '2025-04-16 21:00:00+03'),
(10, 'LIKE', 4, 12, '2025-04-16 21:30:00+03'),
-- о FastAPI
(11, 'LIKE', 11, 13, '2025-04-22 16:00:00+03'),
(12, 'LIKE', 7, 13, '2025-04-22 16:30:00+03'),

-- к постам Dmitry Sidorov
-- о результате тренировки
(13, 'LIKE', 3, 14, '2025-04-18 22:00:00+03'),
(14, 'LIKE', 9, 14, '2025-04-18 22:30:00+03'),
-- об "Искусстве войны"
(15, 'LIKE', 6, 15, '2025-04-25 14:00:00+03'),
(16, 'DISLIKE', 10, 16, '2025-04-25 14:30:00+03'),

-- к постам Olga Nikolaeva
-- о результате заплыва
(17, 'LIKE', 6, 16, '2025-04-17 23:00:00+03'),
(18, 'LIKE', 7, 16, '2025-04-18 00:00:00+03'),
-- о подготовке к заплыву
(19, 'LIKE', 8, 17, '2025-04-18 10:00:00+03'),
(20, 'LIKE', 10, 17, '2025-04-18 10:30:00+03'),
-- удачи на соревнованиях
(21, 'LIKE', 6, 18, '2025-04-23 11:00:00+03'),
(22, 'LIKE', 9, 18, '2025-04-23 11:30:00+03'),

-- к постам Maxim Fedorov
-- о теме бизнес-плана
(23, 'LIKE', 7, 19, '2025-04-19 18:00:00+03'),
(24, 'LIKE', 5, 19, '2025-04-19 18:30:00+03'),
-- о технологиях для стартапа
(25, 'LIKE', 11, 20, '2025-04-27 13:00:00+03'),
(26, 'DISLIKE', 4, 20, '2025-04-27 13:30:00+03');


-- Реакции на комментарии в сообществах
INSERT INTO reactions (id, type, user_id, comment_id, created_at)
VALUES
-- "Трейдеры и инвесторы"
-- о шорте
(27, 'LIKE', 1, 21, '2025-04-10 10:30:00+03'),
(28, 'LIKE', 4, 21, '2025-04-10 11:00:00+03'),
-- об отчете по запасам
(29, 'LIKE', 3, 22, '2025-04-10 12:00:00+03'),
(30, 'DISLIKE', 1, 22, '2025-04-10 12:30:00+03'),
-- о Tesla
(31, 'LIKE', 4, 23, '2025-04-10 16:00:00+03'),
(32, 'LIKE', 2, 23, '2025-04-10 16:30:00+03'),
-- о покупке Tesla
(33, 'DISLIKE', 1, 24, '2025-04-10 17:00:00+03'),
(34, 'DISLIKE', 3, 24, '2025-04-10 17:30:00+03'),

-- "Java Developers"
-- о совместимости Spring Boot
(35, 'LIKE', 4, 25, '2025-04-11 13:00:00+03'),
(36, 'LIKE', 2, 25, '2025-04-11 13:30:00+03'),
-- о TestContainers
(37, 'LIKE', 5, 26, '2025-04-11 15:00:00+03'),
(38, 'LIKE', 7, 26, '2025-04-11 15:30:00+03'),
-- о Hibernate vs JPA
(39, 'LIKE', 11, 27, '2025-04-11 17:30:00+03'),
(40, 'LIKE', 2, 27, '2025-04-11 18:00:00+03'),
-- о Virtual Threads
(41, 'LIKE', 4, 28, '2025-04-11 19:30:00+03'),
(42, 'LIKE', 11, 28, '2025-04-11 20:00:00+03'),

-- "Спортивное плавание"
-- об участии в чемпионате
(43, 'LIKE', 6, 29, '2025-04-12 14:00:00+03'),
(44, 'LIKE', 10, 29, '2025-04-12 14:30:00+03'),
-- о дистанциях
(45, 'LIKE', 8, 30, '2025-04-12 15:00:00+03'),
(46, 'LIKE', 9, 30, '2025-04-12 15:30:00+03'),
-- о гидрокостюмах
(47, 'LIKE', 6, 31, '2025-04-12 19:00:00+03'),
(48, 'LIKE', 10, 31, '2025-04-12 19:30:00+03');

SELECT setval('reactions_id_seq', (SELECT MAX(id) FROM reactions));
